class AdminHistory < Hanami::Entity
  def formatted_action
    action_number_hash = {
      1 => "ブロック会議の新規作成",
      2 => "ブロック会議の編集",
      3 => "ブロック会議の削除",
      4 => "ブロック会議の議案ダウンロード",
      5 => "議案の新規作成",
      6 => "議案の編集",
      7 => "議案の削除",
      8 => "議案の順番の変更",
      9 => "議案の状態（通常・追加議案）の変更",
      10 => "管理者のログイン",
      11 => "管理者のログアウト",
      12 => "議事録の編集",
      13 => "議事録の削除",
      14 => "表の新規作成",
      15 => "表の編集",
      16 => "表の削除",
      17 => "議事録への返答の新規作成",
      18 => "議事録への返答の編集",
      19 => "議事録への返答の削除"
    }
    action_number_hash.fetch(action, 'その他の操作')
  end
end
